In [2]:
import pandas as pd

In [38]:
db_credit = pd.read_excel(r'C:\Users\Felipe\Desktop\Credit Card\credit.xls')

In [39]:
db_credit.head()

,Unnamed: 0,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0

In [40]:
db_credit.rename(columns={'Unnamed: 0':'id', 'X1':'given_credit', 'X2':'sex', 'X3':'education', 'X4':'marriage',
                          'X5': 'age', 'X6':'status_sept', 'X7':'status_aug', 'X8':'status_jul', 'X9':'status_jun',
                          'X10':'status_mar','X11':'status_apr','X12':'amount_bill_sept', 'X13':'amount_bill_aug',
                          'X14':'amount_bill_jul','X15':'amount_bill_jun', 'X16':'amount_bill_mar','X17':'amount_bill_apr',
                          'X18':'payment_bill_sept','X19':'payment_bill_aug','X20':'payment_bill_jul','X21':'payment_bill_jun',
                          'X22':'payment_bill_mar','X23':'payment_bill_apr', 'Y':'default_payment_next_month'}, inplace = True)
db_credit.drop(0, axis = 0, inplace = True)
db_credit.head()

,id,given_credit,sex,education,marriage,age,status_sept,status_aug,status_jul,status_jun,...,amount_bill_jun,amount_bill_mar,amount_bill_apr,payment_bill_sept,payment_bill_aug,payment_bill_jul,payment_bill_jun,payment_bill_mar,payment_bill_apr,default_payment_next_month
1,1,20000,2,2,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,1
2,2,120000,2,2,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,1
3,3,90000,2,2,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,0
4,4,50000,2,2,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,0
5,5,50000,1,2,1,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,0

In [46]:
db_credit['sex'].replace([1,2], ['male', 'female'], inplace = True)
db_credit['education'].replace([1, 2, 3, 4], ['graduate','university', 'high school', 'others'], inplace = True)
db_credit['marriage'].replace([1, 2, 3], ['married', 'single', 'others'], inplace = True)
db_credit['default_payment_next_month'].replace([0, 1], ['no', 'yes'], inplace = True)
db_credit.head()

,id,given_credit,sex,education,marriage,age,status_sept,status_aug,status_jul,status_jun,...,amount_bill_jun,amount_bill_mar,amount_bill_apr,payment_bill_sept,payment_bill_aug,payment_bill_jul,payment_bill_jun,payment_bill_mar,payment_bill_apr,default_payment_next_month
1,1,20000,female,university,married,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,yes
2,2,120000,female,university,single,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,yes
3,3,90000,female,university,single,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,no
4,4,50000,female,university,married,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,no
5,5,50000,male,university,married,57,-1,0,-1,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,no

In [47]:
db_credit.set_index('id')

,given_credit,sex,education,marriage,age,status_sept,status_aug,status_jul,status_jun,status_mar,...,amount_bill_jun,amount_bill_mar,amount_bill_apr,payment_bill_sept,payment_bill_aug,payment_bill_jul,payment_bill_jun,payment_bill_mar,payment_bill_apr,default_payment_next_month
id,,,,,,,,,,,,,,,,,,,,,
1,20000,female,university,married,24,2,2,-1,-1,-2,...,0,0,0,0,689,0,0,0,0,yes
2,120000,female,university,single,26,-1,2,0,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,yes
3,90000,female,university,single,34,0,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,no
4,50000,female,university,married,37,0,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,no
5,50000,male,university,married,57,-1,0,-1,0,0,...,20940,19146,19131,2000,36681,10000,9000,689,679,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29996,220000,male,high school,married,39,0,0,0,0,0,...,88004,31237,15980,8500,20000,5003,3047,5000,1000,no
29997,150000,male,high school,single,43,-1,-1,-1,-1,0,...,8979,5190,0,1837,3526,8998,129,0,0,no
29998,30000,male,university,single,37,4,3,2,-1,0,...,20878,20582,19357,0,0,22000,4200,2000,3100,yes
29999,80000,male,high school,married,41,1,-1,0,0,0,...,52774,11855,48944,85900,3409,1178,1926,52964,1804,yes
30000,50000,male,university,married,46,0,0,0,0,0,...,36535,32428,15313,2078,1800,1430,1000,1000,1000,yes